app/controllers/comments_controller.rb

  def new
    @comment = Comment.new
    @comments =Comment.all
---
SELECT * FROM `comments`

  def create
    @comment = Comment.new(params[:comment])
    @comment.user_id = current_user.id
    if @comment.save
---
INSERT INTO `comments` (`created_at`, `updated_at`, `user_id`, `content`, `message_id`) VALUES('2010-08-26 18:31:41', '2010-08-26 18:31:41', 1, 'bla bla bla', NULL)