app/controllers/messages_controller.rb

SELECT * FROM `messages` ORDER BY created_at DESC
---
  def index
    @message = Message.new
    @messages = Message.all(:order => "created_at DESC")

INSERT INTO `messages` (`created_at`, `updated_at`, `user_id`, `content`) VALUES('2010-08-25 13:48:05', '2010-08-25 13:48:05', NULL, 'teste')
---
  def create
    @message = Message.new(params[:message])
    @message.user_id = current_user.id
    respond_to do |format|
      if @message.save

INSERT INTO `opinions` (`created_at`, `updated_at`, `opinion`, `user_id`, `message_id`) VALUES('2010-08-26 15:11:47', '2010-08-26 15:11:47', NULL, 1, 4)
---
  def opinion
    @opinion = Opinion.new(:message_id => params[:message],:opinion => params[:opinion],:user_id => current_user.id)
    if @opinion.save