app/controllers/messages_controller.rb

SELECT * FROM `messages` LIMIT 1
---
  def index
    @message = Message.new
    @messages = Message.all(:order => "created_at DESC")

INSERT INTO `users` (`created_at`, `crypted_password`, `updated_at`, `username`, `gender`, `password_salt`, `persistence_token`, `age`, `email`, `civil`) VALUES('2010-08-25 23:15:54', '0349906cc873338e95f3a96eb79fc8c0165d02e612cccf7e17e89eb96502ea0879b01475dd282623d052a871303280899bbb430b98a7e41554f25a4ce4f0f477', '2010-08-25 23:15:54', 'admin', NULL, 'J4RBGOUtH7dm7bovjqtQ', '32037acdfbf012188a420b7232cb0c8a72ed6d7af641fbf21d13a65f3ffb8057dbf22a260dbdac048d11ff3093a189d7cff5b47ee1d9d1fabab8d92293a0ad9b', NULL, 'admin@admin.com.br', NULL)
---
  def create
    @message = Message.new(params[:message])
    @message.user_id = current_user.id
    respond_to do |format|
      if @message.save

INSERT INTO `messages` (`created_at`, `updated_at`, `user_id`, `content`) VALUES('2010-08-26 14:44:24', '2010-08-26 14:44:24', 1, 'teste')
INSERT INTO `users` (`created_at`, `crypted_password`, `updated_at`, `username`, `gender`, `password_salt`, `persistence_token`, `age`, `email`, `civil`) VALUES('2010-08-26 14:44:24', 'c87743fd24dd57fd34afa51738be3ad5fc750b13321c4062c1bee1657d22d8a236c4fadf7b517b5a6fc66c840840d9ae57b6b94104d91a590ecdac64a62756f5', '2010-08-26 14:44:24', 'admin', NULL, 'OofF4iIHB8V8mxT6fB4Z', 'bae43f24f32a6522019253abca772bfc50505667ba7808e0ce5293e075800065c56708425f7a61679effc60ed88ff7765c53b28bf2dbeacf7d06101e8a68d628', NULL, 'admin@admin.com.br', NULL)
---
  def opinion
    @opinion = Opinion.new(:message_id => params[:message],:opinion => params[:opinion],:user_id => current_user.id)
    if @opinion.save