app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `crypted_password`, `updated_at`, `username`, `password_salt`, `persistence_token`, `email`) VALUES('2010-08-24 15:07:37', '3454f418330768611bc23bf8db1be97dc2098240901408307e97c40017f37ee661044db63dae68ee32b96dcbdd8623debcf842d0ae7ff1526481bd81e060328a', '2010-08-24 15:07:37', 'teste', 'ph2q27kgZKW3Vpfy4aJQ', '1eb2e864832f024278121dad7d89bcb9d1052aec1f79d257de1e3762ec5080874e012256305f7a50ac01a4658920673b10d009f8ec91850067af5241a4e47f6a', 'teste@teste.com.br')
---
  def create
    @user = User.new(params[:user])
    if @user.save